# Создать список из десяти целых чисел.
# Вывести на экран каждое число, увеличенное на 1.

lst = list(range(10))

for i in lst:
    print(i + 1)