# Ввести с клавиатуры строку.
# Вывести эту же строку вертикально: по одному символу на строку консоли.

word = input('Please enter sth: ')
for letter in word:
    print(letter)